Repository: Logarzesrem/gazeta-internetowa
Catalog: translations/validators.*.xlf
Languages: pl

source: A category with this name already exists.
pl: Kategoria o tej nazwie już istnieje.

source: validation.name.not_blank
pl: Nazwa nie może być pusta.

source: validation.name.too_short
pl: Nazwa musi mieć co najmniej 2 znaki.

source: validation.name.too_long
pl: Nazwa nie może przekraczać 255 znaków.

source: validation.slug.invalid
pl: Slug zawiera nieprawidłowe znaki.

source: validation.title.not_blank
pl: Tytuł nie może być pusty.

source: validation.title.too_short
pl: Tytuł musi mieć co najmniej 3 znaki.

source: validation.title.too_long
pl: Tytuł nie może przekraczać 255 znaków.

source: validation.content.not_blank
pl: Treść nie może być pusta.

source: validation.content.too_short
pl: Treść musi mieć co najmniej 10 znaków.

source: validation.content.too_long
pl: Treść nie może przekraczać 10000 znaków.

source: This email is already registered.
pl: Ten adres email jest już zarejestrowany.

source: This username is already taken.
pl: Ta nazwa użytkownika jest już zajęta.

source: Email is required.
pl: Email jest wymagany.

source: Email is too long.
pl: Email jest za długi.

source: Username is required.
pl: Nazwa użytkownika jest wymagana.

source: Username must be at least 3 characters long.
pl: Nazwa użytkownika musi mieć co najmniej 3 znaki.

source: Username cannot exceed 50 characters.
pl: Nazwa użytkownika nie może przekraczać 50 znaków.

source: Username can only contain letters, numbers, and underscores.
pl: Nazwa użytkownika może zawierać tylko litery, cyfry i podkreślniki.

source: Name is required.
pl: Imię jest wymagane.

source: Name must be at least 2 characters long.
pl: Imię musi mieć co najmniej 2 znaki.

source: Name cannot exceed 255 characters.
pl: Imię nie może przekraczać 255 znaków.

source: Password is required.
pl: Hasło jest wymagane.

source: Password must be at least 8 characters long.
pl: Hasło musi mieć co najmniej 8 znaków.

source: Password cannot exceed 50 characters.
pl: Hasło nie może przekraczać 50 znaków.

source: Password must contain at least one letter and one number.
pl: Hasło musi zawierać co najmniej jedną literę i jedną cyfrę.
